Revit 2026 API

# Rectangle Properties

---

The Rectangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Bottom | The y-coordinate of the bottom-right corner of the rectangle. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Left | The x-coordinate of the top-left corner of the rectangle. |
|  | Right | The x-coordinate of the bottom-right corner of the rectangle. |
|  | Top | The y-coordinate of the top-left corner of the rectangle. |

#### Reference

Rectangle Class

Autodesk.Revit.DB Namespace